CrazyRedMachine/Arduino-Lufa/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

menu.optimization=Optimize for

menu.defaultserial=Default Serial Port

menu.experimentalsavings=Experimental Size Reductions

##############################################################

micro.name=Arduino Micro (LUFA)

micro.vid.0=0x2341
micro.pid.0=0x0037
micro.vid.1=0x2341
micro.pid.1=0x8037
micro.vid.2=0x2A03
micro.pid.2=0x0037
micro.vid.3=0x2A03
micro.pid.3=0x8037
micro.vid.4=0x2341
micro.pid.4=0x0237
micro.vid.5=0x2341
micro.pid.5=0x8237

micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

micro.build.optimization_flags=-Os

micro.menu.optimization.size=Size (Os)
micro.menu.optimization.size.build.optimization_flags=-Os
micro.menu.optimization.balance=Balance (O2)
micro.menu.optimization.balance.build.optimization_flags=-O2
micro.menu.optimization.speed=Speed (O3)
micro.menu.optimization.speed.build.optimization_flags=-O3

micro.build.serial_flags=-DSerial=Serial1

micro.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
micro.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
micro.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
micro.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
micro.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
micro.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

micro.menu.experimentalsavings.safest=No extra parameters (Safest)
micro.menu.experimentalsavings.safest.build.savings_flags=
micro.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
micro.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
micro.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
micro.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize

##############################################################

yun.name=Arduino Yún (LUFA)
yun.upload.via_ssh=true

yun.vid.0=0x2341
yun.pid.0=0x0041
yun.vid.1=0x2341
yun.pid.1=0x8041
yun.vid.2=0x2A03
yun.pid.2=0x0041
yun.vid.3=0x2A03
yun.pid.3=0x8041

yun.upload.tool=avrdude
yun.upload.protocol=avr109
yun.upload.maximum_size=28672
yun.upload.maximum_data_size=2560
yun.upload.speed=57600
yun.upload.disable_flushing=true
yun.upload.use_1200bps_touch=true
yun.upload.wait_for_upload_port=true

yun.bootloader.tool=avrdude
yun.bootloader.low_fuses=0xff
yun.bootloader.high_fuses=0xd8
yun.bootloader.extended_fuses=0xfb
yun.bootloader.file=caterina/Caterina-Yun.hex
yun.bootloader.noblink=caterina/Caterina-Yun-noblink.hex
yun.bootloader.unlock_bits=0x3F
yun.bootloader.lock_bits=0x2F

yun.build.mcu=atmega32u4
yun.build.f_cpu=16000000L
yun.build.vid=0x2341
yun.build.pid=0x8041
yun.build.usb_product="Arduino Yun"
yun.build.board=AVR_YUN
yun.build.core=arduino
yun.build.variant=yun
yun.build.extra_flags={build.usb_flags}

yun.build.optimization_flags=-Os

yun.menu.optimization.size=Size (Os)
yun.menu.optimization.size.build.optimization_flags=-Os
yun.menu.optimization.balance=Balance (O2)
yun.menu.optimization.balance.build.optimization_flags=-O2
yun.menu.optimization.speed=Speed (O3)
yun.menu.optimization.speed.build.optimization_flags=-O3

yun.build.serial_flags=-DSerial=Serial1

yun.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
yun.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
yun.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
yun.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
yun.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
yun.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

yun.menu.experimentalsavings.safest=No extra parameters (Safest)
yun.menu.experimentalsavings.safest.build.savings_flags=
yun.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
yun.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
yun.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
yun.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


##############################################################

leonardo.name=Arduino Leonardo (LUFA)
leonardo.vid.0=0x2341
leonardo.pid.0=0x0036
leonardo.vid.1=0x2341
leonardo.pid.1=0x8036
leonardo.vid.2=0x2A03
leonardo.pid.2=0x0036
leonardo.vid.3=0x2A03
leonardo.pid.3=0x8036

leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb
leonardo.bootloader.file=caterina/Caterina-Leonardo.hex
leonardo.bootloader.unlock_bits=0x3F
leonardo.bootloader.lock_bits=0x2F

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=AVR_LEONARDO
leonardo.build.core=arduino
leonardo.build.variant=leonardo
leonardo.build.extra_flags={build.usb_flags}

