CrazyRedMachine/Arduino-Lufa/boards.txt
leonardo.build.optimization_flags=-Os

leonardo.menu.optimization.size=Size (Os)
leonardo.menu.optimization.size.build.optimization_flags=-Os
leonardo.menu.optimization.balance=Balance (O2)
leonardo.menu.optimization.balance.build.optimization_flags=-O2
leonardo.menu.optimization.speed=Speed (O3)
leonardo.menu.optimization.speed.build.optimization_flags=-O3

leonardo.build.serial_flags=-DSerial=Serial1

leonardo.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
leonardo.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
leonardo.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
leonardo.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
leonardo.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
leonardo.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

leonardo.menu.experimentalsavings.safest=No extra parameters (Safest)
leonardo.menu.experimentalsavings.safest.build.savings_flags=
leonardo.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
leonardo.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
leonardo.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
leonardo.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


##############################################################

leonardoeth.name=Arduino Leonardo ETH (LUFA)
leonardoeth.vid.0=0x2a03
leonardoeth.pid.0=0x0040
leonardoeth.vid.1=0x2a03
leonardoeth.pid.1=0x8040

leonardoeth.upload.tool=avrdude
leonardoeth.upload.protocol=avr109
leonardoeth.upload.maximum_size=28672
leonardoeth.upload.maximum_data_size=2560
leonardoeth.upload.speed=57600
leonardoeth.upload.disable_flushing=true
leonardoeth.upload.use_1200bps_touch=true
leonardoeth.upload.wait_for_upload_port=true

leonardoeth.bootloader.tool=avrdude
leonardoeth.bootloader.low_fuses=0xff
leonardoeth.bootloader.high_fuses=0xd8
leonardoeth.bootloader.extended_fuses=0xcb
leonardoeth.bootloader.file=caterina/Caterina-LeonardoEthernet.hex
leonardoeth.bootloader.unlock_bits=0x3F
leonardoeth.bootloader.lock_bits=0x2F

leonardoeth.build.mcu=atmega32u4
leonardoeth.build.f_cpu=16000000L
leonardoeth.build.vid=0x2a03
leonardoeth.build.pid=0x8040
leonardoeth.build.usb_product="Arduino Leonardo ETH"
leonardoeth.build.board=AVR_LEONARDO_ETH
leonardoeth.build.core=arduino
leonardoeth.build.variant=leonardo
leonardoeth.build.extra_flags={build.usb_flags}

leonardoeth.build.optimization_flags=-Os

leonardoeth.menu.optimization.size=Size (Os)
leonardoeth.menu.optimization.size.build.optimization_flags=-Os
leonardoeth.menu.optimization.balance=Balance (O2)
leonardoeth.menu.optimization.balance.build.optimization_flags=-O2
leonardoeth.menu.optimization.speed=Speed (O3)
leonardoeth.menu.optimization.speed.build.optimization_flags=-O3

leonardoeth.build.serial_flags=-DSerial=Serial1

leonardoeth.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
leonardoeth.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
leonardoeth.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
leonardoeth.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
leonardoeth.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
leonardoeth.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

leonardoeth.menu.experimentalsavings.safest=No extra parameters (Safest)
leonardoeth.menu.experimentalsavings.safest.build.savings_flags=
leonardoeth.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
leonardoeth.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
leonardoeth.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
leonardoeth.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize

##############################################################

esplora.name=Arduino Esplora (LUFA)
esplora.vid.0=0x2341
esplora.pid.0=0x003C
esplora.vid.1=0x2341
esplora.pid.1=0x803C
esplora.vid.2=0x2A03
esplora.pid.2=0x003C
esplora.vid.3=0x2A03
esplora.pid.3=0x803C

esplora.upload.tool=avrdude
esplora.upload.protocol=avr109
esplora.upload.maximum_size=28672
esplora.upload.maximum_data_size=2560
esplora.upload.speed=57600
esplora.upload.disable_flushing=true
esplora.upload.use_1200bps_touch=true
esplora.upload.wait_for_upload_port=true

esplora.bootloader.tool=avrdude
esplora.bootloader.low_fuses=0xff
esplora.bootloader.high_fuses=0xd8
esplora.bootloader.extended_fuses=0xcb
esplora.bootloader.file=caterina/Caterina-Esplora.hex
esplora.bootloader.unlock_bits=0x3F
esplora.bootloader.lock_bits=0x2F

esplora.build.mcu=atmega32u4
esplora.build.f_cpu=16000000L
esplora.build.vid=0x2341
esplora.build.pid=0x803c
esplora.build.usb_product="Arduino Esplora"
esplora.build.board=AVR_ESPLORA
esplora.build.core=arduino
esplora.build.variant=leonardo
esplora.build.extra_flags={build.usb_flags}

esplora.build.optimization_flags=-Os

esplora.menu.optimization.size=Size (Os)
esplora.menu.optimization.size.build.optimization_flags=-Os
esplora.menu.optimization.balance=Balance (O2)
esplora.menu.optimization.balance.build.optimization_flags=-O2
esplora.menu.optimization.speed=Speed (O3)
esplora.menu.optimization.speed.build.optimization_flags=-O3

esplora.build.serial_flags=-DSerial=Serial1

esplora.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
esplora.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
esplora.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
esplora.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
esplora.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
esplora.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

esplora.menu.experimentalsavings.safest=No extra parameters (Safest)
esplora.menu.experimentalsavings.safest.build.savings_flags=
esplora.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
esplora.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
esplora.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
esplora.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


