CrazyRedMachine/Arduino-Lufa/boards.txt
##############################################################

LilyPadUSB.name=LilyPad Arduino USB (LUFA)
LilyPadUSB.vid.0=0x1B4F
LilyPadUSB.pid.0=0x9207
LilyPadUSB.vid.1=0x1B4F
LilyPadUSB.pid.1=0x9208

LilyPadUSB.upload.tool=avrdude
LilyPadUSB.upload.protocol=avr109
LilyPadUSB.upload.maximum_size=28672
LilyPadUSB.upload.maximum_data_size=2560
LilyPadUSB.upload.speed=57600
LilyPadUSB.upload.disable_flushing=true
LilyPadUSB.upload.use_1200bps_touch=true
LilyPadUSB.upload.wait_for_upload_port=true

LilyPadUSB.bootloader.tool=avrdude
LilyPadUSB.bootloader.low_fuses=0xff
LilyPadUSB.bootloader.high_fuses=0xd8
LilyPadUSB.bootloader.extended_fuses=0xce
LilyPadUSB.bootloader.file=caterina-LilyPadUSB/Caterina-LilyPadUSB.hex
LilyPadUSB.bootloader.unlock_bits=0x3F
LilyPadUSB.bootloader.lock_bits=0x2F

LilyPadUSB.build.mcu=atmega32u4
LilyPadUSB.build.f_cpu=8000000L
LilyPadUSB.build.vid=0x1B4F
LilyPadUSB.build.pid=0x9208
LilyPadUSB.build.usb_product="LilyPad USB"
LilyPadUSB.build.board=AVR_LILYPAD_USB
LilyPadUSB.build.core=arduino
LilyPadUSB.build.variant=leonardo
LilyPadUSB.build.extra_flags={build.usb_flags}

LilyPadUSB.build.optimization_flags=-Os

LilyPadUSB.menu.optimization.size=Size (Os)
LilyPadUSB.menu.optimization.size.build.optimization_flags=-Os
LilyPadUSB.menu.optimization.balance=Balance (O2)
LilyPadUSB.menu.optimization.balance.build.optimization_flags=-O2
LilyPadUSB.menu.optimization.speed=Speed (O3)
LilyPadUSB.menu.optimization.speed.build.optimization_flags=-O3

LilyPadUSB.build.serial_flags=-DSerial=Serial1

LilyPadUSB.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
LilyPadUSB.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
LilyPadUSB.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
LilyPadUSB.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
LilyPadUSB.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
LilyPadUSB.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

LilyPadUSB.menu.experimentalsavings.safest=No extra parameters (Safest)
LilyPadUSB.menu.experimentalsavings.safest.build.savings_flags=
LilyPadUSB.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
LilyPadUSB.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
LilyPadUSB.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
LilyPadUSB.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


##############################################################

robotControl.name=Arduino Robot Control (LUFA)
robotControl.vid.0=0x2341
robotControl.pid.0=0x0038
robotControl.vid.1=0x2341
robotControl.pid.1=0x8038
robotControl.vid.2=0x2A03
robotControl.pid.2=0x0038
robotControl.vid.3=0x2A03
robotControl.pid.3=0x8038

robotControl.upload.tool=avrdude
robotControl.upload.protocol=avr109
robotControl.upload.maximum_size=28672
robotControl.upload.maximum_data_size=2560
robotControl.upload.speed=57600
robotControl.upload.disable_flushing=true
robotControl.upload.use_1200bps_touch=true
robotControl.upload.wait_for_upload_port=true

robotControl.bootloader.tool=avrdude
robotControl.bootloader.low_fuses=0xff
robotControl.bootloader.high_fuses=0xd8
robotControl.bootloader.extended_fuses=0xcb
robotControl.bootloader.file=caterina-Arduino_Robot/Caterina-Robot-Control.hex
robotControl.bootloader.unlock_bits=0x3F
robotControl.bootloader.lock_bits=0x2F

robotControl.build.mcu=atmega32u4
robotControl.build.f_cpu=16000000L
robotControl.build.vid=0x2341
robotControl.build.pid=0x8038
robotControl.build.usb_product="Robot Control"
robotControl.build.board=AVR_ROBOT_CONTROL
robotControl.build.core=arduino
robotControl.build.variant=robot_control
robotControl.build.extra_flags={build.usb_flags}

robotControl.build.optimization_flags=-Os

robotControl.menu.optimization.size=Size (Os)
robotControl.menu.optimization.size.build.optimization_flags=-Os
robotControl.menu.optimization.balance=Balance (O2)
robotControl.menu.optimization.balance.build.optimization_flags=-O2
robotControl.menu.optimization.speed=Speed (O3)
robotControl.menu.optimization.speed.build.optimization_flags=-O3

robotControl.build.serial_flags=-DSerial=Serial1

robotControl.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
robotControl.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
robotControl.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
robotControl.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
robotControl.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
robotControl.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

robotControl.menu.experimentalsavings.safest=No extra parameters (Safest)
robotControl.menu.experimentalsavings.safest.build.savings_flags=
robotControl.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
robotControl.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
robotControl.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
robotControl.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


##############################################################

robotMotor.name=Arduino Robot Motor (LUFA)
robotMotor.vid.0=0x2341
robotMotor.pid.0=0x0039
robotMotor.vid.1=0x2341
robotMotor.pid.1=0x8039
robotMotor.vid.2=0x2A03
robotMotor.pid.2=0x0039
robotMotor.vid.3=0x2A03
robotMotor.pid.3=0x8039

robotMotor.upload.tool=avrdude
robotMotor.upload.protocol=avr109
robotMotor.upload.maximum_size=28672
robotMotor.upload.maximum_data_size=2560
robotMotor.upload.speed=57600
robotMotor.upload.disable_flushing=true
robotMotor.upload.use_1200bps_touch=true
robotMotor.upload.wait_for_upload_port=true

robotMotor.bootloader.tool=avrdude
robotMotor.bootloader.low_fuses=0xff
robotMotor.bootloader.high_fuses=0xd8
robotMotor.bootloader.extended_fuses=0xcb
robotMotor.bootloader.file=caterina-Arduino_Robot/Caterina-Robot-Motor.hex
robotMotor.bootloader.unlock_bits=0x3F
robotMotor.bootloader.lock_bits=0x2F

robotMotor.build.mcu=atmega32u4
robotMotor.build.f_cpu=16000000L
robotMotor.build.vid=0x2341
robotMotor.build.pid=0x8039
robotMotor.build.usb_product="Robot Motor"
robotMotor.build.board=AVR_ROBOT_MOTOR
robotMotor.build.core=arduino
robotMotor.build.variant=robot_motor
robotMotor.build.extra_flags={build.usb_flags}

robotMotor.build.optimization_flags=-Os

robotMotor.menu.optimization.size=Size (Os)
robotMotor.menu.optimization.size.build.optimization_flags=-Os
robotMotor.menu.optimization.balance=Balance (O2)
robotMotor.menu.optimization.balance.build.optimization_flags=-O2
robotMotor.menu.optimization.speed=Speed (O3)
robotMotor.menu.optimization.speed.build.optimization_flags=-O3

robotMotor.build.serial_flags=-DSerial=Serial1

robotMotor.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
robotMotor.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
robotMotor.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
robotMotor.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
robotMotor.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
robotMotor.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

robotMotor.menu.experimentalsavings.safest=No extra parameters (Safest)
robotMotor.menu.experimentalsavings.safest.build.savings_flags=
robotMotor.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
robotMotor.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
robotMotor.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
robotMotor.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


