CrazyRedMachine/Arduino-Lufa/boards.txt
##############################################################

# Adafruit Circuit Playground 32u4 w/Caterina Configuration
circuitplay32u4cat.name=Adafruit Circuit Playground (LUFA)
circuitplay32u4cat.bootloader.low_fuses=0xff
circuitplay32u4cat.bootloader.high_fuses=0xd8
circuitplay32u4cat.bootloader.extended_fuses=0xcb
circuitplay32u4cat.bootloader.file=caterina/Caterina-Circuitplay32u4.hex
circuitplay32u4cat.bootloader.unlock_bits=0x3F
circuitplay32u4cat.bootloader.lock_bits=0x2F
circuitplay32u4cat.bootloader.tool=avrdude
circuitplay32u4cat.build.mcu=atmega32u4
circuitplay32u4cat.build.f_cpu=8000000L
circuitplay32u4cat.build.vid=0x239A
circuitplay32u4cat.build.pid=0x8011
circuitplay32u4cat.build.core=arduino
circuitplay32u4cat.build.variant=circuitplay32u4
circuitplay32u4cat.build.board=AVR_CIRCUITPLAY
circuitplay32u4cat.build.usb_product="Circuit Playground"
circuitplay32u4cat.build.usb_manufacturer="Adafruit"
circuitplay32u4cat.build.extra_flags={build.usb_flags}
circuitplay32u4cat.upload.protocol=avr109
circuitplay32u4cat.upload.maximum_size=28672
circuitplay32u4cat.upload.speed=57600
circuitplay32u4cat.upload.disable_flushing=true
circuitplay32u4cat.upload.use_1200bps_touch=true
circuitplay32u4cat.upload.wait_for_upload_port=true
circuitplay32u4cat.upload.tool=avrdude
circuitplay32u4cat.vid.0=0x239A
circuitplay32u4cat.pid.0=0x8011

circuitplay32u4cat.build.optimization_flags=-Os

circuitplay32u4cat.menu.optimization.size=Size (Os)
circuitplay32u4cat.menu.optimization.size.build.optimization_flags=-Os
circuitplay32u4cat.menu.optimization.balance=Balance (O2)
circuitplay32u4cat.menu.optimization.balance.build.optimization_flags=-O2
circuitplay32u4cat.menu.optimization.speed=Speed (O3)
circuitplay32u4cat.menu.optimization.speed.build.optimization_flags=-O3

circuitplay32u4cat.build.serial_flags=-DSerial=Serial1

circuitplay32u4cat.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
circuitplay32u4cat.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
circuitplay32u4cat.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
circuitplay32u4cat.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
circuitplay32u4cat.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
circuitplay32u4cat.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

circuitplay32u4cat.menu.experimentalsavings.safest=No extra parameters (Safest)
circuitplay32u4cat.menu.experimentalsavings.safest.build.savings_flags=
circuitplay32u4cat.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
circuitplay32u4cat.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
circuitplay32u4cat.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
circuitplay32u4cat.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


##############################################################

yunmini.name=Arduino Yún Mini (LUFA)
yunmini.upload.via_ssh=true

yunmini.vid.0=0x2a03
yunmini.pid.0=0x0050
yunmini.vid.1=0x2a03
yunmini.pid.1=0x8050

yunmini.upload.tool=avrdude
yunmini.upload.protocol=avr109
yunmini.upload.maximum_size=28672
yunmini.upload.maximum_data_size=2560
yunmini.upload.speed=57600
yunmini.upload.disable_flushing=true
yunmini.upload.use_1200bps_touch=true
yunmini.upload.wait_for_upload_port=true

yunmini.bootloader.tool=avrdude
yunmini.bootloader.low_fuses=0xff
yunmini.bootloader.high_fuses=0xd8
yunmini.bootloader.extended_fuses=0xfb
yunmini.bootloader.file=caterina/Caterina-YunMini.hex
yunmini.bootloader.unlock_bits=0x3F
yunmini.bootloader.lock_bits=0x2F

yunmini.build.mcu=atmega32u4
yunmini.build.f_cpu=16000000L
yunmini.build.vid=0x2a03
yunmini.build.pid=0x8050
yunmini.build.usb_product="Arduino Yún Mini"
yunmini.build.board=AVR_YUNMINI
yunmini.build.core=arduino
yunmini.build.variant=yun
yunmini.build.extra_flags={build.usb_flags}

yunmini.build.optimization_flags=-Os

yunmini.menu.optimization.size=Size (Os)
yunmini.menu.optimization.size.build.optimization_flags=-Os
yunmini.menu.optimization.balance=Balance (O2)
yunmini.menu.optimization.balance.build.optimization_flags=-O2
yunmini.menu.optimization.speed=Speed (O3)
yunmini.menu.optimization.speed.build.optimization_flags=-O3

yunmini.build.serial_flags=-DSerial=Serial1

yunmini.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
yunmini.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
yunmini.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
yunmini.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
yunmini.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
yunmini.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

yunmini.menu.experimentalsavings.safest=No extra parameters (Safest)
yunmini.menu.experimentalsavings.safest.build.savings_flags=
yunmini.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
yunmini.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
yunmini.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
yunmini.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


##############################################################

chiwawa.name=Arduino Industrial 101 (LUFA)
chiwawa.upload.via_ssh=true

chiwawa.vid.0=0x2a03
chiwawa.pid.0=0x0056
chiwawa.vid.1=0x2a03
chiwawa.pid.1=0x8056

chiwawa.upload.tool=avrdude
chiwawa.upload.protocol=avr109
chiwawa.upload.maximum_size=28672
chiwawa.upload.maximum_data_size=2560
chiwawa.upload.speed=57600
chiwawa.upload.disable_flushing=true
chiwawa.upload.use_1200bps_touch=true
chiwawa.upload.wait_for_upload_port=true

chiwawa.bootloader.tool=avrdude
chiwawa.bootloader.low_fuses=0xff
chiwawa.bootloader.high_fuses=0xd8
chiwawa.bootloader.extended_fuses=0xfb
chiwawa.bootloader.file=caterina/Caterina-Industrial101.hex
chiwawa.bootloader.unlock_bits=0x3F
chiwawa.bootloader.lock_bits=0x2F

chiwawa.build.mcu=atmega32u4
chiwawa.build.f_cpu=16000000L
chiwawa.build.vid=0x2a03
chiwawa.build.pid=0x8056
chiwawa.build.usb_product="Arduino Industrial 101"
chiwawa.build.board=AVR_INDUSTRIAL101
chiwawa.build.core=arduino
chiwawa.build.variant=yun
chiwawa.build.extra_flags={build.usb_flags}

chiwawa.build.optimization_flags=-Os

chiwawa.menu.optimization.size=Size (Os)
chiwawa.menu.optimization.size.build.optimization_flags=-Os
chiwawa.menu.optimization.balance=Balance (O2)
chiwawa.menu.optimization.balance.build.optimization_flags=-O2
chiwawa.menu.optimization.speed=Speed (O3)
chiwawa.menu.optimization.speed.build.optimization_flags=-O3

chiwawa.build.serial_flags=-DSerial=Serial1

chiwawa.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
chiwawa.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
chiwawa.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
chiwawa.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
chiwawa.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
chiwawa.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

chiwawa.menu.experimentalsavings.safest=No extra parameters (Safest)
chiwawa.menu.experimentalsavings.safest.build.savings_flags=
chiwawa.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
chiwawa.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
chiwawa.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
chiwawa.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


