CrazyRedMachine/Arduino-Lufa/boards.txt
##############################################################

one.name=Linino One (LUFA)
one.upload.via_ssh=true

one.vid.0=0x2a03
one.pid.0=0x0001
one.vid.1=0x2a03
one.pid.1=0x8001

one.upload.tool=avrdude
one.upload.protocol=avr109
one.upload.maximum_size=28672
one.upload.maximum_data_size=2560
one.upload.speed=57600
one.upload.disable_flushing=true
one.upload.use_1200bps_touch=true
one.upload.wait_for_upload_port=true

one.bootloader.tool=avrdude
one.bootloader.low_fuses=0xff
one.bootloader.high_fuses=0xd8
one.bootloader.extended_fuses=0xfb
one.bootloader.file=caterina/Caterina-LininoOne.hex
one.bootloader.unlock_bits=0x3F
one.bootloader.lock_bits=0x2F

one.build.mcu=atmega32u4
one.build.f_cpu=16000000L
one.build.vid=0x2a03
one.build.pid=0x8001
one.build.usb_product="Linino One"
one.build.board=AVR_LININO_ONE
one.build.core=arduino
one.build.variant=yun
one.build.extra_flags={build.usb_flags}

one.build.optimization_flags=-Os

one.menu.optimization.size=Size (Os)
one.menu.optimization.size.build.optimization_flags=-Os
one.menu.optimization.balance=Balance (O2)
one.menu.optimization.balance.build.optimization_flags=-O2
one.menu.optimization.speed=Speed (O3)
one.menu.optimization.speed.build.optimization_flags=-O3

one.build.serial_flags=-DSerial=Serial1

one.menu.defaultserial.hwserial=Hardware Serial (aka Serial1)
one.menu.defaultserial.hwserial.build.serial_flags=-DSerial=Serial1
one.menu.defaultserial.vserial1=Virtual Serial 1 (SerialU1)
one.menu.defaultserial.vserial1.build.serial_flags=-DSerial=SerialU1
one.menu.defaultserial.vserial2=Virtual Serial 2 (SerialU2)
one.menu.defaultserial.vserial2.build.serial_flags=-DSerial=SerialU2

one.menu.experimentalsavings.safest=No extra parameters (Safest)
one.menu.experimentalsavings.safest.build.savings_flags=
one.menu.experimentalsavings.knowngood=-fno-devirtualize -fno-use-cxa-atexit (Known to work)
one.menu.experimentalsavings.knowngood.build.savings_flags=-fno-devirtualize -fno-use-cxa-atexit
one.menu.experimentalsavings.novirt=-fno-devirtualize (Should be safe)
one.menu.experimentalsavings.novirt.build.savings_flags=-fno-devirtualize


##############################################################

#uno.name=Arduino Uno ((LUFA not supported))

#uno.vid.0=0x2341
#uno.pid.0=0x0043
#uno.vid.1=0x2341
#uno.pid.1=0x0001
#uno.vid.2=0x2A03
#uno.pid.2=0x0043
#uno.vid.3=0x2341
#uno.pid.3=0x0243

#uno.upload.tool=avrdude
#uno.upload.protocol=arduino
#uno.upload.maximum_size=32256
#uno.upload.maximum_data_size=2048
#uno.upload.speed=115200

#uno.bootloader.tool=avrdude
#uno.bootloader.low_fuses=0xFF
#uno.bootloader.high_fuses=0xDE
#uno.bootloader.extended_fuses=0xFD
#uno.bootloader.unlock_bits=0x3F
#uno.bootloader.lock_bits=0x0F
#uno.bootloader.file=optiboot/optiboot_atmega328.hex

#uno.build.mcu=atmega328p
#uno.build.f_cpu=16000000L
#uno.build.board=AVR_UNO
#uno.build.core=arduino
#uno.build.variant=standard

##############################################################

#diecimila.name=Arduino Duemilanove or Diecimila ((LUFA not supported))

#diecimila.upload.tool=avrdude
#diecimila.upload.protocol=arduino

#diecimila.bootloader.tool=avrdude
#diecimila.bootloader.low_fuses=0xFF
#diecimila.bootloader.unlock_bits=0x3F
#diecimila.bootloader.lock_bits=0x0F

#diecimila.build.f_cpu=16000000L
#diecimila.build.board=AVR_DUEMILANOVE
#diecimila.build.core=arduino
#diecimila.build.variant=standard

## Arduino Duemilanove or Diecimila w/ ATmega328P
## ----------------------------------------------
#diecimila.menu.cpu.atmega328=ATmega328P

#diecimila.menu.cpu.atmega328.upload.maximum_size=30720
#diecimila.menu.cpu.atmega328.upload.maximum_data_size=2048
#diecimila.menu.cpu.atmega328.upload.speed=57600

#diecimila.menu.cpu.atmega328.bootloader.high_fuses=0xDA
#diecimila.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
#diecimila.menu.cpu.atmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

#diecimila.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Duemilanove or Diecimila w/ ATmega168
## ---------------------------------------------
#diecimila.menu.cpu.atmega168=ATmega168

#diecimila.menu.cpu.atmega168.upload.maximum_size=14336
#diecimila.menu.cpu.atmega168.upload.maximum_data_size=1024
#diecimila.menu.cpu.atmega168.upload.speed=19200

#diecimila.menu.cpu.atmega168.bootloader.high_fuses=0xdd
#diecimila.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
#diecimila.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_diecimila.hex

#diecimila.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

#nano.name=Arduino Nano ((LUFA not supported))

#nano.upload.tool=avrdude
#nano.upload.protocol=arduino

#nano.bootloader.tool=avrdude
#nano.bootloader.unlock_bits=0x3F
#nano.bootloader.lock_bits=0x0F

#nano.build.f_cpu=16000000L
#nano.build.board=AVR_NANO
#nano.build.core=arduino
#nano.build.variant=eightanaloginputs

## Arduino Nano w/ ATmega328P
## --------------------------
#nano.menu.cpu.atmega328=ATmega328P

#nano.menu.cpu.atmega328.upload.maximum_size=30720
#nano.menu.cpu.atmega328.upload.maximum_data_size=2048
#nano.menu.cpu.atmega328.upload.speed=115200

#nano.menu.cpu.atmega328.bootloader.low_fuses=0xFF
#nano.menu.cpu.atmega328.bootloader.high_fuses=0xDA
#nano.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
#nano.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328.hex

#nano.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Nano w/ ATmega328P (old bootloader)
## --------------------------
#nano.menu.cpu.atmega328old=ATmega328P (Old Bootloader)

#nano.menu.cpu.atmega328old.upload.maximum_size=30720
#nano.menu.cpu.atmega328old.upload.maximum_data_size=2048
#nano.menu.cpu.atmega328old.upload.speed=57600

#nano.menu.cpu.atmega328old.bootloader.low_fuses=0xFF
#nano.menu.cpu.atmega328old.bootloader.high_fuses=0xDA
#nano.menu.cpu.atmega328old.bootloader.extended_fuses=0xFD
#nano.menu.cpu.atmega328old.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

