CrazyRedMachine/Arduino-Lufa/boards.txt
#nano.menu.cpu.atmega328old.build.mcu=atmega328p

## Arduino Nano w/ ATmega168
## -------------------------
#nano.menu.cpu.atmega168=ATmega168

#nano.menu.cpu.atmega168.upload.maximum_size=14336
#nano.menu.cpu.atmega168.upload.maximum_data_size=1024
#nano.menu.cpu.atmega168.upload.speed=19200

#nano.menu.cpu.atmega168.bootloader.low_fuses=0xff
#nano.menu.cpu.atmega168.bootloader.high_fuses=0xdd
#nano.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
#nano.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_diecimila.hex

#nano.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

#mega.name=Arduino Mega or Mega 2560 ((LUFA not supported))

#mega.vid.0=0x2341
#mega.pid.0=0x0010
#mega.vid.1=0x2341
#mega.pid.1=0x0042
#mega.vid.2=0x2A03
#mega.pid.2=0x0010
#mega.vid.3=0x2A03
#mega.pid.3=0x0042
#mega.vid.4=0x2341
#mega.pid.4=0x0210
#mega.vid.5=0x2341
#mega.pid.5=0x0242

#mega.upload.tool=avrdude
#mega.upload.maximum_data_size=8192

#mega.bootloader.tool=avrdude
#mega.bootloader.low_fuses=0xFF
#mega.bootloader.unlock_bits=0x3F
#mega.bootloader.lock_bits=0x0F

#mega.build.f_cpu=16000000L
#mega.build.core=arduino
#mega.build.variant=mega
# default board may be overridden by the cpu menu
#mega.build.board=AVR_MEGA2560

## Arduino Mega w/ ATmega2560
## -------------------------
#mega.menu.cpu.atmega2560=ATmega2560 (Mega 2560)

#mega.menu.cpu.atmega2560.upload.protocol=wiring
#mega.menu.cpu.atmega2560.upload.maximum_size=253952
#mega.menu.cpu.atmega2560.upload.speed=115200

#mega.menu.cpu.atmega2560.bootloader.high_fuses=0xD8
#mega.menu.cpu.atmega2560.bootloader.extended_fuses=0xFD
#mega.menu.cpu.atmega2560.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex

#mega.menu.cpu.atmega2560.build.mcu=atmega2560
#mega.menu.cpu.atmega2560.build.board=AVR_MEGA2560

## Arduino Mega w/ ATmega1280
## -------------------------
#mega.menu.cpu.atmega1280=ATmega1280

#mega.menu.cpu.atmega1280.upload.protocol=arduino
#mega.menu.cpu.atmega1280.upload.maximum_size=126976
#mega.menu.cpu.atmega1280.upload.speed=57600

#mega.menu.cpu.atmega1280.bootloader.high_fuses=0xDA
#mega.menu.cpu.atmega1280.bootloader.extended_fuses=0xF5
#mega.menu.cpu.atmega1280.bootloader.file=atmega/ATmegaBOOT_168_atmega1280.hex

#mega.menu.cpu.atmega1280.build.mcu=atmega1280
#mega.menu.cpu.atmega1280.build.board=AVR_MEGA

##############################################################

#megaADK.name=Arduino Mega ADK ((LUFA not supported))

#megaADK.vid.0=0x2341
#megaADK.pid.0=0x003f
#megaADK.vid.1=0x2341
#megaADK.pid.1=0x0044
#megaADK.vid.2=0x2A03
#megaADK.pid.2=0x003f
#megaADK.vid.3=0x2A03
#megaADK.pid.3=0x0044

#megaADK.upload.tool=avrdude
#megaADK.upload.protocol=wiring
#megaADK.upload.maximum_size=253952
#megaADK.upload.maximum_data_size=8192
#megaADK.upload.speed=115200

#megaADK.bootloader.tool=avrdude
#megaADK.bootloader.low_fuses=0xFF
#megaADK.bootloader.high_fuses=0xD8
#megaADK.bootloader.extended_fuses=0xFD
#megaADK.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex
#megaADK.bootloader.unlock_bits=0x3F
#megaADK.bootloader.lock_bits=0x0F

#megaADK.build.mcu=atmega2560
#megaADK.build.f_cpu=16000000L
#megaADK.build.board=AVR_ADK
#megaADK.build.core=arduino
#megaADK.build.variant=mega

##############################################################

#mini.name=Arduino Mini ((LUFA not supported))

#mini.upload.tool=avrdude
#mini.upload.protocol=arduino

#mini.bootloader.tool=avrdude
#mini.bootloader.low_fuses=0xff
#mini.bootloader.unlock_bits=0x3F
#mini.bootloader.lock_bits=0x0F

#mini.build.f_cpu=16000000L
#mini.build.board=AVR_MINI
#mini.build.core=arduino
#mini.build.variant=eightanaloginputs

## Arduino Mini w/ ATmega328P
## --------------------------
#mini.menu.cpu.atmega328=ATmega328P

#mini.menu.cpu.atmega328.upload.maximum_size=28672
#mini.menu.cpu.atmega328.upload.maximum_data_size=2048
#mini.menu.cpu.atmega328.upload.speed=115200

#mini.menu.cpu.atmega328.bootloader.high_fuses=0xd8
#mini.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
#mini.menu.cpu.atmega328.bootloader.file=optiboot/optiboot_atmega328-Mini.hex

#mini.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Mini w/ ATmega168
## -------------------------
#mini.menu.cpu.atmega168=ATmega168

#mini.menu.cpu.atmega168.upload.maximum_size=14336
#mini.menu.cpu.atmega168.upload.maximum_data_size=1024
#mini.menu.cpu.atmega168.upload.speed=19200

#mini.menu.cpu.atmega168.bootloader.high_fuses=0xdd
#mini.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
#mini.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_ng.hex

#mini.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

#ethernet.name=Arduino Ethernet ((LUFA not supported))

#ethernet.upload.tool=avrdude
#ethernet.upload.protocol=arduino
#ethernet.upload.maximum_size=32256
#ethernet.upload.maximum_data_size=2048
#ethernet.upload.speed=115200

#ethernet.bootloader.tool=avrdude
#ethernet.bootloader.low_fuses=0xff
#ethernet.bootloader.high_fuses=0xde
#ethernet.bootloader.extended_fuses=0xFD
#ethernet.bootloader.file=optiboot/optiboot_atmega328.hex
#ethernet.bootloader.unlock_bits=0x3F
#ethernet.bootloader.lock_bits=0x0F

#ethernet.build.variant=ethernet
#ethernet.build.mcu=atmega328p
#ethernet.build.f_cpu=16000000L
#ethernet.build.board=AVR_ETHERNET
#ethernet.build.core=arduino

##############################################################

#fio.name=Arduino Fio ((LUFA not supported))

#fio.upload.tool=avrdude
#fio.upload.protocol=arduino
#fio.upload.maximum_size=30720
#fio.upload.maximum_data_size=2048
#fio.upload.speed=57600

#fio.bootloader.tool=avrdude
#fio.bootloader.low_fuses=0xFF
#fio.bootloader.high_fuses=0xDA
#fio.bootloader.extended_fuses=0xFD
#fio.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex
#fio.bootloader.unlock_bits=0x3F
#fio.bootloader.lock_bits=0x0F

#fio.build.mcu=atmega328p
#fio.build.f_cpu=8000000L
#fio.build.board=AVR_FIO
#fio.build.core=arduino
#fio.build.variant=eightanaloginputs

