CrazyRedMachine/Arduino-Lufa/boards.txt
##############################################################

#bt.name=Arduino BT ((LUFA not supported))

#bt.upload.tool=avrdude
#bt.upload.protocol=arduino
#bt.upload.speed=19200
#bt.upload.disable_flushing=true

#bt.bootloader.tool=avrdude
#bt.bootloader.low_fuses=0xff
#bt.bootloader.unlock_bits=0x3F
#bt.bootloader.lock_bits=0x0F

#bt.build.f_cpu=16000000L
#bt.build.board=AVR_BT
#bt.build.core=arduino
#bt.build.variant=eightanaloginputs

## Arduino BT w/ ATmega328P
## ------------------------
#bt.menu.cpu.atmega328=ATmega328P
#bt.menu.cpu.atmega328.upload.maximum_size=28672
#bt.menu.cpu.atmega328.upload.maximum_data_size=2048

#bt.menu.cpu.atmega328.bootloader.high_fuses=0xd8
#bt.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
#bt.menu.cpu.atmega328.bootloader.file=bt/ATmegaBOOT_168_atmega328_bt.hex

#bt.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino BT w/ ATmega168
## -----------------------
#bt.menu.cpu.atmega168=ATmega168
#bt.menu.cpu.atmega168.upload.maximum_size=14336
#bt.menu.cpu.atmega168.upload.maximum_data_size=1024

#bt.menu.cpu.atmega168.bootloader.high_fuses=0xdd
#bt.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
#bt.menu.cpu.atmega168.bootloader.file=bt/ATmegaBOOT_168.hex

#bt.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

#lilypad.name=LilyPad Arduino ((LUFA not supported))

#lilypad.upload.tool=avrdude
#lilypad.upload.protocol=arduino

#lilypad.bootloader.tool=avrdude
#lilypad.bootloader.unlock_bits=0x3F
#lilypad.bootloader.lock_bits=0x0F

#lilypad.build.f_cpu=8000000L
#lilypad.build.board=AVR_LILYPAD
#lilypad.build.core=arduino
#lilypad.build.variant=standard

## LilyPad Arduino w/ ATmega328P
## -----------------------------
#lilypad.menu.cpu.atmega328=ATmega328P

#lilypad.menu.cpu.atmega328.upload.maximum_size=30720
#lilypad.menu.cpu.atmega328.upload.maximum_data_size=2048
#lilypad.menu.cpu.atmega328.upload.speed=57600

#lilypad.menu.cpu.atmega328.bootloader.low_fuses=0xFF
#lilypad.menu.cpu.atmega328.bootloader.high_fuses=0xDA
#lilypad.menu.cpu.atmega328.bootloader.extended_fuses=0xFD
#lilypad.menu.cpu.atmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

#lilypad.menu.cpu.atmega328.build.mcu=atmega328p

## LilyPad Arduino w/ ATmega168
## ----------------------------
#lilypad.menu.cpu.atmega168=ATmega168

#lilypad.menu.cpu.atmega168.upload.maximum_size=14336
#lilypad.menu.cpu.atmega168.upload.maximum_data_size=1024
#lilypad.menu.cpu.atmega168.upload.speed=19200

#lilypad.menu.cpu.atmega168.bootloader.low_fuses=0xe2
#lilypad.menu.cpu.atmega168.bootloader.high_fuses=0xdd
#lilypad.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
#lilypad.menu.cpu.atmega168.bootloader.file=lilypad/LilyPadBOOT_168.hex

#lilypad.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

#pro.name=Arduino Pro or Pro Mini ((LUFA not supported))

#pro.upload.tool=avrdude
#pro.upload.protocol=arduino

#pro.bootloader.tool=avrdude
#pro.bootloader.unlock_bits=0x3F
#pro.bootloader.lock_bits=0x0F

#pro.build.board=AVR_PRO
#pro.build.core=arduino
#pro.build.variant=eightanaloginputs

## Arduino Pro or Pro Mini (5V, 16 MHz) w/ ATmega328P
## --------------------------------------------------
#pro.menu.cpu.16MHzatmega328=ATmega328P (5V, 16 MHz)

#pro.menu.cpu.16MHzatmega328.upload.maximum_size=30720
#pro.menu.cpu.16MHzatmega328.upload.maximum_data_size=2048
#pro.menu.cpu.16MHzatmega328.upload.speed=57600

#pro.menu.cpu.16MHzatmega328.bootloader.low_fuses=0xFF
#pro.menu.cpu.16MHzatmega328.bootloader.high_fuses=0xDA
#pro.menu.cpu.16MHzatmega328.bootloader.extended_fuses=0xFD
#pro.menu.cpu.16MHzatmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

#pro.menu.cpu.16MHzatmega328.build.mcu=atmega328p
#pro.menu.cpu.16MHzatmega328.build.f_cpu=16000000L

## Arduino Pro or Pro Mini (3.3V, 8 MHz) w/ ATmega328P
## ---------------------------------------------------
#pro.menu.cpu.8MHzatmega328=ATmega328P (3.3V, 8 MHz)

#pro.menu.cpu.8MHzatmega328.upload.maximum_size=30720
#pro.menu.cpu.8MHzatmega328.upload.maximum_data_size=2048
#pro.menu.cpu.8MHzatmega328.upload.speed=57600

#pro.menu.cpu.8MHzatmega328.bootloader.low_fuses=0xFF
#pro.menu.cpu.8MHzatmega328.bootloader.high_fuses=0xDA
#pro.menu.cpu.8MHzatmega328.bootloader.extended_fuses=0xFD
#pro.menu.cpu.8MHzatmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

#pro.menu.cpu.8MHzatmega328.build.mcu=atmega328p
#pro.menu.cpu.8MHzatmega328.build.f_cpu=8000000L

## Arduino Pro or Pro Mini (5V, 16 MHz) w/ ATmega168
## -------------------------------------------------
#pro.menu.cpu.16MHzatmega168=ATmega168 (5V, 16 MHz)

#pro.menu.cpu.16MHzatmega168.upload.maximum_size=14336
#pro.menu.cpu.16MHzatmega168.upload.maximum_data_size=1024
#pro.menu.cpu.16MHzatmega168.upload.speed=19200

#pro.menu.cpu.16MHzatmega168.bootloader.low_fuses=0xff
#pro.menu.cpu.16MHzatmega168.bootloader.high_fuses=0xdd
#pro.menu.cpu.16MHzatmega168.bootloader.extended_fuses=0xF8
#pro.menu.cpu.16MHzatmega168.bootloader.file=atmega/ATmegaBOOT_168_diecimila.hex

#pro.menu.cpu.16MHzatmega168.build.mcu=atmega168
#pro.menu.cpu.16MHzatmega168.build.f_cpu=16000000L

## Arduino Pro or Pro Mini (3.3V, 8 MHz) w/ ATmega168
## --------------------------------------------------
#pro.menu.cpu.8MHzatmega168=ATmega168 (3.3V, 8 MHz)

#pro.menu.cpu.8MHzatmega168.upload.maximum_size=14336
#pro.menu.cpu.8MHzatmega168.upload.maximum_data_size=1024
#pro.menu.cpu.8MHzatmega168.upload.speed=19200

#pro.menu.cpu.8MHzatmega168.bootloader.low_fuses=0xc6
#pro.menu.cpu.8MHzatmega168.bootloader.high_fuses=0xdd
#pro.menu.cpu.8MHzatmega168.bootloader.extended_fuses=0xF8
#pro.menu.cpu.8MHzatmega168.bootloader.file=atmega/ATmegaBOOT_168_pro_8MHz.hex

#pro.menu.cpu.8MHzatmega168.build.mcu=atmega168
#pro.menu.cpu.8MHzatmega168.build.f_cpu=8000000L

