CrazyRedMachine/Arduino-Lufa/boards.txt
##############################################################

#atmegang.name=Arduino NG or older ((LUFA not supported))

#atmegang.upload.tool=avrdude
#atmegang.upload.protocol=arduino
#atmegang.upload.speed=19200

#atmegang.bootloader.tool=avrdude
#atmegang.bootloader.unlock_bits=0x3F
#atmegang.bootloader.lock_bits=0x0F

#atmegang.build.mcu=atmegang
#atmegang.build.f_cpu=16000000L
#atmegang.build.board=AVR_NG
#atmegang.build.core=arduino
#atmegang.build.variant=standard

## Arduino NG or older w/ ATmega168
## --------------------------------
#atmegang.menu.cpu.atmega168=ATmega168

#atmegang.menu.cpu.atmega168.upload.maximum_size=14336
#atmegang.menu.cpu.atmega168.upload.maximum_data_size=1024

#atmegang.menu.cpu.atmega168.bootloader.low_fuses=0xff
#atmegang.menu.cpu.atmega168.bootloader.high_fuses=0xdd
#atmegang.menu.cpu.atmega168.bootloader.extended_fuses=0xF8
#atmegang.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_ng.hex

#atmegang.menu.cpu.atmega168.build.mcu=atmega168

## Arduino NG or older w/ ATmega8
## ------------------------------
#atmegang.menu.cpu.atmega8=ATmega8

#atmegang.menu.cpu.atmega8.upload.maximum_size=7168
#atmegang.menu.cpu.atmega8.upload.maximum_data_size=1024

#atmegang.menu.cpu.atmega8.bootloader.low_fuses=0xdf
#atmegang.menu.cpu.atmega8.bootloader.high_fuses=0xca
#atmegang.menu.cpu.atmega8.bootloader.extended_fuses=
#atmegang.menu.cpu.atmega8.bootloader.file=atmega8/ATmegaBOOT-prod-firmware-2009-11-07.hex

#atmegang.menu.cpu.atmega8.build.mcu=atmega8

##############################################################

#gemma.vid.0=0x2341
#gemma.pid.0=0x0c9f

#gemma.name=Arduino Gemma ((LUFA not supported))

#gemma.bootloader.low_fuses=0xF1
#gemma.bootloader.high_fuses=0xD5
#gemma.bootloader.extended_fuses=0xFE
#gemma.bootloader.tool=avrdude
#gemma.bootloader.lock_bits=
#gemma.bootloader.unlock_bits=
#gemma.bootloader.file=gemma/gemma_v1.hex

#gemma.build.mcu=attiny85
#gemma.build.f_cpu=8000000L
#gemma.build.core=arduino
#gemma.build.variant=gemma
#gemma.build.board=AVR_GEMMA

#gemma.upload.tool=avrdude
#gemma.upload.maximum_size=5310

##############################################################

#unowifi.name=Arduino Uno WiFi ((LUFA not supported))
#unowifi.vid.0=0x2A03
#unowifi.pid.0=0x0057

#unowifi.upload.tool=avrdude
#unowifi.upload.protocol=arduino
#unowifi.upload.maximum_size=32256
#unowifi.upload.maximum_data_size=2048
#unowifi.upload.speed=115200
#unowifi.upload.network.endpoint_upload=/pgm/upload
#unowifi.upload.network.endpoint_sync=/pgm/sync
#unowifi.upload.network.sync_return=204:SYNC
#unowifi.upload.network.endpoint_reset=/log/reset
#unowifi.upload.network.port=80

#unowifi.bootloader.tool=avrdude
#unowifi.bootloader.low_fuses=0xFF
#unowifi.bootloader.high_fuses=0xDE
#unowifi.bootloader.extended_fuses=0x05
#unowifi.bootloader.unlock_bits=0x3F
#unowifi.bootloader.lock_bits=0x0F
#unowifi.bootloader.file=optiboot/optiboot_atmega328.hex

#unowifi.build.mcu=atmega328p
#unowifi.build.f_cpu=16000000L
#unowifi.build.board=AVR_UNO_WIFI_DEV_ED
#unowifi.build.core=arduino
#unowifi.build.variant=standard
#unowifi.build.esp_ch_uart_br=19200
#unowifi.build.extra_flags=-DESP_CH_UART -DESP_CH_UART_BR={build.esp_ch_uart_br}
